In [3]:
import pandas as pd
d={'price':[1,2,3,5,6],'count':[10,20,30,40,50], 'procent':[12,20,45,76,46], 'cat':['A','B','A','A','C']}
df=pd.DataFrame(d)
df

   price  count  procent cat
0      1     10       12   A
1      2     20       20   B
2      3     30       45   A
3      5     40       76   A
4      6     50       46   C

In [4]:
df[df['price']>3]

   price  count  procent cat
3      5     40       76   A
4      6     50       46   C

In [5]:
df[lambda x: x['cat']=='A' ]

   price  count  procent cat
0      1     10       12   A
2      3     30       45   A
3      5     40       76   A

In [6]:
df[df['cat']=='A']

   price  count  procent cat
0      1     10       12   A
2      3     30       45   A
3      5     40       76   A

In [7]:
df[df['cat'].map(lambda x: x=='A')]

   price  count  procent cat
0      1     10       12   A
2      3     30       45   A
3      5     40       76   A

In [8]:
s=pd.Series([10,20,30,40,50,30,10],['A','B','C','D','E','F','G'])
s.isin([10,20])

A     True
B     True
C    False
D    False
E    False
F    False
G     True
dtype: bool

In [9]:
d={'price':[1,2,3,5,6],'count':[10,20,30,40,50], 'procent':[12,20,45,76,46], 'cat':['A','B','A','A','C']}
df=pd.DataFrame(d)
df

   price  count  procent cat
0      1     10       12   A
1      2     20       20   B
2      3     30       45   A
3      5     40       76   A
4      6     50       46   C

In [10]:
df.isin([1,3,25,10])

   price  count  procent    cat
0   True   True    False  False
1  False  False    False  False
2   True  False    False  False
3  False  False    False  False
4  False  False    False  False

###Типы данных

In [11]:
df.dtypes

price       int64
count       int64
procent     int64
cat        object
dtype: object

In [12]:
d=[{'name':'pen', 'price':3.9,'count':8}, {'name':'book', 'price':9.8,'count':18}]
df=pd.DataFrame(d)
df.dtypes

name      object
price    float64
count      int64
dtype: object

In [13]:
df['count'].astype('int32')

0     8
1    18
Name: count, dtype: int32

In [14]:
df=df.astype({'count':'int64'})
df.dtypes

name      object
price    float64
count      int64
dtype: object

In [15]:
df=pd.read_csv('data.csv',sep=';')
df

       Температура  Давление Осадки        Дата
0     -8 (Цельсия)  96292 Па     Да  20-11-2019
1  -10,3 (Цельсия)  97292 Па     Да  21-11-2019
2   -9,1 (Цельсия)  96325 Па    Нет  22-11-2019

In [16]:
df.dtypes

Температура    object
Давление       object
Осадки         object
Дата           object
dtype: object

In [17]:
temperconvertor=lambda x:x.replace('(Цельсия)','').strip()
to_point=lambda x: x.replace(',', '.')
preasure_convertor=lambda x:x.replace('Па','').strip()
prec_convertor=lambda x: True if x=='Да' else False

In [18]:
df['Температура'] = df['Температура'].apply(temperconvertor).apply(to_point).astype('float64')
df['Давление'] = df['Давление'].apply(preasure_convertor).astype('float64')
df['Осадки'] = df['Осадки'].apply(prec_convertor).astype('float64')

In [19]:
df

   Температура  Давление  Осадки        Дата
0         -8.0   96292.0     1.0  20-11-2019
1        -10.3   97292.0     1.0  21-11-2019
2         -9.1   96325.0     0.0  22-11-2019

***Отсутствующие данные

In [20]:
from io import StringIO

In [21]:
data='price,count,precent\n1,10,\n2,20,51\n3,30,'
df=pd.read_csv(StringIO(data), sep=',')
df

   price  count  precent
0      1     10      NaN
1      2     20     51.0
2      3     30      NaN

In [22]:
df.loc[3]={'price':4,'count':None, 'precent':26.5}
df

   price count  precent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.5

In [23]:
df.isnull()

   price  count  precent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   count    3 non-null      object
 2   precent  2 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [25]:
df.isnull().sum()

price      0
count      1
precent    2
dtype: int64

In [26]:
df.fillna(0)

   price  count  precent
0      1     10      0.0
1      2     20     51.0
2      3     30      0.0
3      4      0     26.5

In [27]:
df.fillna(df.mean())

   price  count  precent
0      1   10.0    38.75
1      2   20.0    51.00
2      3   30.0    38.75
3      4   20.0    26.50

In [28]:
df.dropna()

   price count  precent
1      2    20     51.0

In [29]:
df.dropna(axis=1)

   price
0      1
1      2
2      3
3      4

In [30]:
df.dropna(axis=1, thresh=3)

   price count
0      1    10
1      2    20
2      3    30
3      4  None

In [31]:
df

   price count  precent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.5

****Adding elements

In [59]:
s = pd.Series([1,2,3,4,5],['A','B','C','D','E'])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [39]:
d={'color':['red','blue','green'], 'speed':[56,24,65]}
df=pd.DataFrame(d)
df

   color  speed
0    red     56
1   blue     24
2  green     65

In [60]:
s['F']=6
s

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [40]:
df['type']=['circle','square','triagle']
df

   color  speed     type
0    red     56   circle
1   blue     24   square
2  green     65  triagle

In [41]:
df['value']=2
df

   color  speed     type  value
0    red     56   circle      2
1   blue     24   square      2
2  green     65  triagle      2

In [51]:

new_row=pd.Series(['yellow',30,'triangle',7],['color','speed','type','value'])
df2=pd.DataFrame(new_row).T
pd.concat([df,df2], ignore_index=True)
df

    color  speed      type  value
0     red     56    circle      2
1    blue     24    square      2
2   green     65   triagle      2
3  yellow     30  triangle      7
4  yellow     30  triangle      7

In [52]:
df.loc[len(df.index)] = ['yellow',30,'triangle',7]
df

    color  speed      type  value
0     red     56    circle      2
1    blue     24    square      2
2   green     65   triagle      2
3  yellow     30  triangle      7
4  yellow     30  triangle      7
5  yellow     30  triangle      7

****Deliting elements

In [61]:
s.drop(['A','B'],inplace=True)
#series
s

C    3
D    4
E    5
F    6
dtype: int64

In [62]:
df

    color  speed      type  value
0     red     56    circle      2
1    blue     24    square      2
2   green     65   triagle      2
3  yellow     30  triangle      7
4  yellow     30  triangle      7
5  yellow     30  triangle      7

In [63]:
df.drop([4,5],inplace=True)
df

    color  speed      type  value
0     red     56    circle      2
1    blue     24    square      2
2   green     65   triagle      2
3  yellow     30  triangle      7

In [64]:
df.drop('value', axis=1,inplace=True)
df

    color  speed      type
0     red     56    circle
1    blue     24    square
2   green     65   triagle
3  yellow     30  triangle

In [67]:
dfr1=pd.DataFrame({'a_type':['a1','a2','a3'],'b_type':['b1','b2','b3'],'c_type':['c1','c2','c3']},index=[0,1,2])
dfr2=pd.DataFrame({'a_type':['a4','a5','a6'],'b_type':['b4','b5','b6'],'c_type':['c4','c5','c6']},index=[3,4,5])
df1=pd.concat([dfr1,dfr2])
df1

  a_type b_type c_type
0     a1     b1     c1
1     a2     b2     c2
2     a3     b3     c3
3     a4     b4     c4
4     a5     b5     c5
5     a6     b6     c6

In [71]:
dfr3=pd.DataFrame({'d_type':['d1','d2','d3'],'e_type':['e1','e2','e3']})
df2=pd.concat([dfr1,dfr3],axis=1)
df2

  a_type b_type c_type d_type e_type
0     a1     b1     c1     d1     e1
1     a2     b2     c2     d2     e2
2     a3     b3     c3     d3     e3

In [72]:
df3=pd.concat([dfr1,dfr2], keys=['dfr1','dfr2'])
df3

       a_type b_type c_type
dfr1 0     a1     b1     c1
     1     a2     b2     c2
     2     a3     b3     c3
dfr2 3     a4     b4     c4
     4     a5     b5     c5
     5     a6     b6     c6

In [75]:
df3.loc['dfr2']

  a_type b_type c_type
3     a4     b4     c4
4     a5     b5     c5
5     a6     b6     c6

In [76]:
dfr4=pd.DataFrame({'d_type':['d1','d2','d3'],'e_type':['e1','e2','e3']}, index=[1,2,3])
dfr4

  d_type e_type
1     d1     e1
2     d2     e2
3     d3     e3

In [79]:
dfr1

  a_type b_type c_type
0     a1     b1     c1
1     a2     b2     c2
2     a3     b3     c3

In [83]:
df4= pd.concat([dfr1, dfr4], axis=1, join='outer')
df4

  a_type b_type c_type d_type e_type
0     a1     b1     c1    NaN    NaN
1     a2     b2     c2     d1     e1
2     a3     b3     c3     d2     e2
3    NaN    NaN    NaN     d3     e3

In [87]:
df5= pd.concat([dfr1, dfr4], axis=1, join='inner')
df5

  a_type b_type c_type d_type e_type
1     a2     b2     c2     d1     e1
2     a3     b3     c3     d2     e2

In [88]:
dfr1=pd.DataFrame({'k':['k1','k2','k3'], 'a_type':['a1','a2','a3'],'b_type':['b1','b2','b3']})
dfr1

    k a_type b_type
0  k1     a1     b1
1  k2     a2     b2
2  k3     a3     b3

In [90]:
dfr2=pd.DataFrame({'k':['k1','k2','k3'],'c_type':['c1','c2','c3']})
dfr2

    k c_type
0  k1     c1
1  k2     c2
2  k3     c3

In [94]:
dfr3=pd.DataFrame({'k':['k0','k1','k2'],'c_type':['c1','c2','c3']})
dfr3

    k c_type
0  k0     c1
1  k1     c2
2  k2     c3

In [92]:
dfm1=pd.merge(dfr1, dfr2, how='left', on='k')
dfm1

    k a_type b_type c_type
0  k1     a1     b1     c1
1  k2     a2     b2     c2
2  k3     a3     b3     c3

In [93]:
dfm2=pd.merge(dfr1,dfr3,how='left', on='k')
dfm2

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3
2  k3     a3     b3    NaN

In [95]:
dfm3=pd.merge(dfr1,dfr3,how='right', on='k')
dfm3

    k a_type b_type c_type
0  k0    NaN    NaN     c1
1  k1     a1     b1     c2
2  k2     a2     b2     c3

In [96]:
dfm4=pd.merge(dfr1,dfr3,how='outer', on='k')
dfm4

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3
2  k3     a3     b3    NaN
3  k0    NaN    NaN     c1

In [97]:
dfm5=pd.merge(dfr1,dfr3,how='inner', on='k')
dfm5

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3

****Загрузка CSV

In [98]:
from io import StringIO

In [101]:
csv_d1='col_A,col_B,col_C\na1,b1,c1\na2,b2,c2'
df=pd.read_csv(StringIO(csv_d1))
df

  col_A col_B col_C
0    a1    b1    c1
1    a2    b2    c2

In [105]:
csv_d2='a1,b1,c1\na2,b2,c2\na3,b3,c3'
df1=pd.read_csv(StringIO(csv_d2),header=None,names=['type_a','type_b','type_c'])
df1

  type_a type_b type_c
0     a1     b1     c1
1     a2     b2     c2
2     a3     b3     c3

In [108]:
df3=pd.read_csv('test.csv',sep=';')
df3

   Name  Age         City
0   Ana   29       Moskow
1  John   21     New-York
2  Ivan   18        Tomsk
3  Mike   32  Los Angeles

In [116]:
df_chunks=pd.read_csv('test.csv', sep=';',chunksize=2)
df_chunks

In [117]:
for i, chunk in enumerate(df_chunks):
    print(f'Chunk #{i}')
    print(chunk)

Chunk #0
   Name  Age      City
0   Ana   29    Moskow
1  John   21  New-York
Chunk #1
   Name  Age         City
2  Ivan   18        Tomsk
3  Mike   32  Los Angeles

In [123]:
df_chunks=pd.read_csv('test.csv', sep=';',chunksize=2)
df_chunks

In [124]:
print(df_chunks.get_chunk())
print(df_chunks.get_chunk())

   Name  Age      City
0   Ana   29    Moskow
1  John   21  New-York
   Name  Age         City
2  Ivan   18        Tomsk
3  Mike   32  Los Angeles

***Запись данных

In [ ]:
csv_data = 'Col_A,Col_A,Col_A\na1,b1,c1\na2,b2,c2'
df=pd.DataFrame(StringIO(csv_data))
df.to_csv('temp.csv')